apache/nuttx/arch/arm/src/stm32/stm32_i2c_alt.c
      stm32_i2c_sendstop(priv);

      /* Trace event */

      stm32_i2c_traceevent(priv,
                           I2CEVENT_ADDRESS_NACKED, priv->msgv->addr);
    }
#endif

  /* ACK in read mode, ACK in write mode is handled separately */

  else if ((priv->flags & I2C_M_READ) != 0 && (status & I2C_SR1_ADDR) != 0 &&
           priv->check_addr_ack)
    {
      /* Reset check addr flag as we are handling this event */

      priv->check_addr_ack = false;

      /* Clear ADDR flag by reading SR2 and adding it to status */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

      /* Note:
       *
       * When reading a single byte the stop condition has  to be set
       * immediately after clearing the state flags, which happens
       * when reading SR2(as SR1 has already been read).
       *
       * Similarly when reading 2 bytes the NACK bit has to be set as just
       * after the clearing of the address.
       */

      if (priv->dcnt == 1 && priv->total_msg_len == 1)
        {
          /* this should only happen when receiving a message of length 1 */

          stm32_i2c_modifyreg(priv,
                              STM32_I2C_CR2_OFFSET, 0, I2C_CR2_ITBUFEN);
          stm32_i2c_sendstop(priv);

          i2cinfo("Address ACKed beginning data reception\n");
          i2cinfo("short read N=1: programming stop bit\n");
          priv->dcnt--;

          /* Trace */

          stm32_i2c_traceevent(priv, I2CEVENT_ADDRESS_ACKED_READ_1, 0);
        }
      else if (priv->dcnt == 2 && priv->total_msg_len == 2)
        {
          /* This should only happen when receiving a message of length 2
           * Set NACK
           */

          stm32_i2c_modifyreg(priv, STM32_I2C_CR1_OFFSET, I2C_CR1_ACK, 0);

          i2cinfo("Address ACKed beginning data reception\n");
          i2cinfo("short read N=2: programming NACK\n");

          /* Trace */

          stm32_i2c_traceevent(priv, I2CEVENT_ADDRESS_ACKED_READ_2, 0);
        }
      else
        {
          i2cinfo("Address ACKed beginning data reception\n");

          /* Trace */

          stm32_i2c_traceevent(priv, I2CEVENT_ADDRESS_ACKED, 0);
        }
    }

  /* Write mode
   *
   * Handles all write related I2C protocol logic. Also handles the
   * ACK event after clearing the ADDR flag as the write has to
   * begin immediately after.
   */

  else if ((priv->flags & (I2C_M_READ)) == 0 &&
           (status & (I2C_SR1_ADDR | I2C_SR1_TXE)) != 0)
    {
      /* The has cleared(ADDR is set, ACK was received after the address)
       * or the transmit buffer is empty flag has been set(TxE) then we can
       * transmit the next byte.
       */

      i2cinfo("Entering write mode dcnt = %i msgc = %i\n",
              priv->dcnt, priv->msgc);

      /* Clear ADDR flag by reading SR2 and adding it to status */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

      /* Address has cleared so don't check on next call */

      priv->check_addr_ack = false;

      /* Check if we have transmitted the whole message or we are after
       * the last byte where the stop condition or else(according to the
       * msg flags) has to be set.
       */

      if (priv->dcnt >= 1)
        {
          /* Transmitting message.
           * Send byte == write data into write register
           */

          stm32_i2c_putreg(priv, STM32_I2C_DR_OFFSET, *priv->ptr++);

          /* Decrease current message length */

          stm32_i2c_traceevent(priv, I2CEVENT_WRITE_TO_DR, priv->dcnt);
          priv->dcnt--;
        }
      else if (priv->dcnt == 0)
        {
          /* After last byte, check what to do based on next message flags */

          if (priv->msgc == 0)
            {
              /* If last message send stop bit */

              stm32_i2c_sendstop(priv);
              i2cinfo("Stop sent dcnt = %i msgc = %i\n",
                       priv->dcnt, priv->msgc);

              /* Decrease counter to get to next message */

              priv->dcnt--;
              i2cinfo("dcnt %i\n", priv->dcnt);
              stm32_i2c_traceevent(priv, I2CEVENT_WRITE_STOP, priv->dcnt);
            }

          /* If there is a next message with no flags or the read flag
           * a restart sequence has to be sent.
           * Note msgv already points to the next message.
           */

          else if (priv->msgc > 0 &&
                   (priv->msgv->flags == 0 ||
                    (priv->msgv[0].flags & I2C_M_READ) != 0))
            {
              stm32_i2c_sendstart(priv);

              i2cinfo("Restart detected!\n");
              i2cinfo("Nextflag %i\n", priv->msgv[0].flags);

              /* Decrease counter to get to next message */

              priv->dcnt--;
              i2cinfo("dcnt %i\n", priv->dcnt);
              stm32_i2c_traceevent(priv, I2CEVENT_WRITE_RESTART, priv->dcnt);
            }

          /* If there is a next message with the NO_RESTART flag
           * do nothing.
           */

          else if (priv->msgc > 0 &&
                  ((priv->msgv->flags & I2C_M_NOSTART) != 0))
            {
              /* Set condition to get to next message */

              priv->dcnt = -1;
              stm32_i2c_traceevent(priv,
                                   I2CEVENT_WRITE_NO_RESTART, priv->dcnt);
            }
          else
            {
              i2cerr(
              "ERROR: Write mode: next message has an unrecognized flag.\n");
              stm32_i2c_traceevent(priv, I2CEVENT_WRITE_FLAG_ERROR,
                                   priv->msgv->flags);
            }
        }
      else
        {
          i2cerr("ERROR: Write mode error.\n");
          stm32_i2c_traceevent(priv, I2CEVENT_WRITE_ERROR, 0);
        }
    }

  /* Read mode
   *
   * Handles all read related I2C protocol logic.
   *
   * * * * * * * WARNING STM32F1xx HARDWARE ERRATA * * * * * * *
   * source: https://github.com/hikob/openlab/blob/master/drivers/stm32/i2c.c
   *
   * RXNE-only events should not be handled since it sometimes
   * fails. Only BTF & RXNE events should be handled (with the
   * consequence of slowing down the transfer).
   *
   * It seems that when a RXNE interrupt is handled 'around'
   * the end of the next byte reception, the DR register read
   * is ignored by the i2c controller: it does not flush the
   * DR with next byte
   *
   * Thus we read twice the same byte and we read effectively
   * read one byte less than expected from the i2c slave point
   * of view.
   *
   * Example:
   * + we want to receive 6 bytes (B1 to B6)
   * + the problem appear when reading B3
   * -> we read B1 B2 B3 B3 B4 B5(B3 twice)
   * -> the i2c transfer was B1 B2 B3 B4 B5(B6 is not sent)
   */

